package AP2014.ContactsBook;

import AP2014.ContactsBook.Field.Field;
import AP2014.ContactsBook.Field.NamedSliderField;
import AP2014.ContactsBook.Field.SelectionField;
import AP2014.ContactsBook.Field.TextField;

import javax.swing.*;
import java.util.ArrayList;
import java.util.Random;

public class ContactModel {

    private final static String[] names = {"آتش", "آرش", "آوه", "ارس", "اشک", "رها", "راد", "زاب", "زال", "زند", "سام", "فرخ", "کیا", "گیو", "آرا", "آلا", "آهو", "پری", "تیر", "رسا", "رها", "رود", "زری", "گلی", "مسل", "نوا", "ویس", "هما", "یاس", "آذین", "آرام", "آراد", "آرتا", "آریا", "آرین", "آزاد", "آساد", "آریو", "اخگر", "اژدر", "امید", "انوش", "ایرج", "بابک", "بهبد", "بهمن", "بیژن", "برنا", "برزن", "پایا", "پشنگ", "پیام", "پویا", "تورج", "جهان", "خسرو", "دارا", "دانو", "رهام", "رستم", "سروش", "سپهر", "سورن", "سهند", "سینا", "شایا", "شهاب", "شهبد", "شوپه", "فرسا", "فرود", "فربد", "فهام", "کارن", "کاوه", "کورس", "کورش", "کیان", "کیوس", "کوشا", "مانی", "مزدک", "مهبد", "نرمن", "نوید", "نیما", "نوژن", "نوذر", "هرمز", "هومن", "هوتن", "یاور", "آتنا", "اختر", "آذین", "آرزو", "آلاء", "آوید", "آوین", "افسر", "بهار", "بهرخ", "بوسه", "پرتو", "پرند", "پریا", "پگاه", "پوپک", "پوری", "پونه", "ترسا", "ترمه", "ترنگ", "تینا", "دانه", "دریا", "دلبر", "دلکش", "دوکا", "دینا", "رامش", "راشر", "رهام", "روان", "روجا", "زرین", "زویا", "زیبا", "زینا", "زیور", "ژاله", "ژرفا", "ژیلا", "ژینر", "ژینا", "سارک", "ساغر", "سایه", "سرگل", "سوری", "سوسن", "سوگل", "سیما", "شادی", "شبره", "شبنم", "شهپر", "شهرخ", "شهین", "شوکا", "شکوه", "شیدا", "شیده", "شیما", "شیوا", "غمزه", "غنچه", "فروغ", "فرین", "قشنگ", "کمند", "کشور", "گلپا", "گلتن", "گلرخ", "گلرو", "گلشن", "گوهر", "گیتا", "گیتی", "گیسو", "گیلا", "لادن", "لاله", "مامک", "مانا", "ماهک", "مژده", "مونا", "مهتا", "مهرا", "مهرخ", "مهرک", "مهری", "مهسا", "مهین", "میخک", "میگل", "مینا", "مینو", "نرگس", "نگار", "نگین", "نهال", "نیکو", "نیکی", "نیشا", "هستی", "یارا", "یکتا", "یسنا", "آبتین", "آترین", "آذرخش", "آذرمه", "آرتین", "آرشام", "آرمان", "آرمین", "آویژه", "آریان", "اُرُد", "ارژنگ", "ارشام", "اروند", "اشکان", "افشین", "البرز", "الوند", "اورنگ", "باربد", "بامین", "بردیا", "بهرام", "بهمنش", "بهروز", "بهراد", "بهرنگ", "بهزاد", "بهداد", "بهشاد", "بهنام", "برسام", "برزین", "بهداد", "پارسا", "پرشان", "پدرام", "پرویز", "پژمان", "پشوتن", "پولاد", "پهلبد", "پیران", "پیروز", "پویان", "پوریا", "پرهام", "پیروز", "پیمان", "تهمتن", "تابان", "جاوید", "جمشید", "چنگیز", "دامون", "دانوش", "داراب", "دیاکو", "رادین", "رامبد", "رامین", "رخشان", "رستان", "روزبه", "رامان", "زرتشت", "زردشت", "زرمهر", "زوبین", "ژوبین", "سالار", "ساسان", "سامان", "سپنتا", "سورنا", "سهراب", "سیامک", "سیاوش", "سیروس", "شروین", "شاپور", "شایان", "شاهرخ", "شاهین", "شهرام", "شهراد", "شهروز", "شیرنگ", "شهیار", "شهنام", "فرزان", "فرزاد", "فرزام", "فرزین", "فردین", "فرداد", "فرمان", "فرهنگ", "فرناد", "فرهاد", "فرهام", "فرهود", "فروهر", "فیروز", "فرشاد", "فرشید", "کوروش", "کاووس", "کیارش", "کیاوش", "کیوان", "گرگین", "گستهم", "گودرز", "ماکان", "ماهان", "مرداس", "مهداد", "مهران", "مهزاد", "مهراب", "مهیار", "مهرنگ", "میلاد", "نکیسا", "نیوشا", "نیاسا", "ونداد", "وهومن", "هامون", "هوشنگ", "هومان", "یزدان", "آرینا", "آزاده", "آسانا", "آفتاب", "آفرین", "آگرین", "آنوشا", "آویده", "آویزه", "آویسا", "آوینه", "اروشا", "افروز", "افروغ", "افشان", "افشار", "ایران", "ایرمن", "بهدیس", "بهدخت", "بهشید", "بهنوش", "باران", "پانیذ", "پدیده", "پردیس", "پرستو", "پرنیا", "پروین", "پریرو", "پریسا", "پریوش", "پوران", "پوران", "پژهان", "ترانه", "تِرنه", "جوانه", "چکامه", "خجسته", "دُرّی", "دلارا", "دلوسه", "روشنک", "ساناز", "سپیده", "ستاره", "ستوده", "سمانه", "سوزان", "سوگند", "سیمین", "شاپرک", "شاپری", "شادان", "شانار", "شهناز", "شکیبا", "شکوفه", "شیرین", "شیفته", "فاختک", "فرانک", "فرشته", "فریبا", "فریما", "فوژان", "فرنوش", "کرانه", "گلاره", "گلاوژ", "گلبیز", "گلپری", "گلتاج", "گلشید", "گلمیس", "گلنار", "گلناز", "گلنوش", "گیلان", "مازون", "مانلی", "ماهتو", "مرجان", "مژگان", "منیژه", "مهتاب", "مهدخت", "مهدیس", "مهراب", "مهرسا", "مهروا", "مهزاد", "مهستی", "مهشید", "مهناز", "مهنوش", "موژان", "میترا", "نازگل", "ناژین", "ناهید", "نرمین", "نسترن", "نسرین", "نوشین", "نیکسا", "یاسمن", "یگانه", "آریانا", "آستیاژ", "آستیاگ", "آریافر", "آریامن", "اردشیر", "اردلان", "اردوان", "اَرَشک", "ارمایل", "اشکبوس", "اورمزد", "بامداد", "بامشاد", "برومند", "پورداد", "پیشداد", "تیرداد", "تهماسب", "تهمورث", "جاماسب", "خداداد", "خدابخش", "خدایار", "خشایار", "خوبیار", "خورشید", "دادویه", "دادمهر", "داریوش", "رامتین", "رادمان", "زامیاد", "شادمهر", "شباهنگ", "شاهکام", "شهرداد", "شهریار", "شیرزاد", "فرامرز", "فریبرز", "فرخزاد", "کامبیز", "کامران", "کامشاد", "کامیار", "کنارنگ", "کیانوش", "کیخسرو", "کیقباد", "کیومرث", "کاروان", "گرشاسب", "گشتاسب", "لهراسب", "مهدیار", "مازیار", "مهرگان", "منوچهر", "مهرداد", "مهرزاد", "مهرشاد", "مهرشاد", "مهزیار", "نریمان", "هورمزد", "هوشیار", "هورداد", "یزدگرد", "یادگار", "آرتمیس", "آرمینا", "آرمینه", "آرمیتا", "آریانا", "آستیاژ", "آندریا", "ابریشم", "افسانه", "اناهید", "اندیشه", "بهاران", "پائیزه", "پارمیس", "پرنیان", "پروانه", "پریچهر", "پریدخت", "پریزاد", "پریشاد", "پریناز", "پیمانه", "پرنیان", "پادینا", "تابنده", "تهمینه", "خورشید", "خوروَش", "دلارام", "رامینا", "رودابه", "رکسانا", "روژینا", "سروناز", "سودابه", "شایسته", "شهرزاد", "شهرناز", "فریناز", "فیروزه", "فریماه", "کتایون", "کیهانه", "گلبانو", "گلبهار", "گلپونه", "ماندان", "ماهدخت", "ماهنوش", "ماهزاد", "مرجانه", "مستانه", "مهرآذر", "مهرانه", "مهربان", "مهکامه", "مهکامه", "نازنین", "نازیلا", "ناژیلا", "نوشزاد", "نیلوفر", "هنگامه", "هوروَش", "یاسمین", "آتورپات", "آریابان", "آزرمگان", "آریامنش", "آریامهر", "بزرگمهر", "به‌آیین", "جهانگیر", "جهانشاه", "جهاندار", "سوشیانت", "سوشیانس", "فرورتیش", "کیکاووس", "مرداویج", "وندیداد", "آریادخت", "آریانوش", "پارمیدا", "شهربانو", "شهربانو", "فروزنده", "گلابتون", "گلشیفته", "گوهرشاد", "لاله‌رخ", "ماندانا", "ماه‌پری", "ماه‌چهر", "مروارید", "آریوبرزن", "اسفندیار", "افراسیاب", "جهان‌بخش", "گَرسیوَز", "آزرمیدخت", "ایراندخت", "پوراندخت", "توراندخت", "زرین‌دخت", "شورانگیز", "گردآفرید", "گل‌افروز", "گل‌اندام", "ماه‌جهان", "مهرانگیز", "نازآفرین", "آیین‌گشسب", "انوشیروان", "ایشتوویگو", "‍‍‍‍‍زاوش", "ماه‌برزین", "مشکان‌دخت", "مشکین‌دخت"};
    private final static String[] relations = {"دوست", "غریبه", "آشنا", "ناشناس"};
    static Random getRandomItem_RANDOM = new Random();
    ArrayList<Field> fields;

    public ContactModel() {
        fields = new ArrayList<Field>();

        fields.add(new TextField("نام"));
        fields.add(new TextField("نام خانوادگی"));
        fields.add(new TextField("شرکت"));
        fields.add(new TextField("شماره تماس", false, "\\d+"));
        fields.add(new TextField("Fax", false, "\\d+"));
        fields.add(new TextField("Email", false, ".+@.+\\..+"));
        fields.add(new SelectionField<JRadioButton>("جنسیت", "زن|مرد", JRadioButton.class));
        fields.add(new SelectionField<JCheckBox>("گروه ها", "دوستان|همکارها|خانواده", JCheckBox.class));
        fields.add(new NamedSliderField("میزان آشنایی", "دوست|آشنا|غریبه|ناشناس"));
    }

    private static String getRandomItem(String[] items) {
        return items[getRandomItem_RANDOM.nextInt(items.length)];
    }

    //Unit testing stuff

    public static ContactModel generateRandomModel() {
        ContactModel c = new ContactModel();

        c.getField("نام").setValue(getRandomItem(names));
        c.getField("نام خانوادگی").setValue(getRandomItem(names) + "ی");
        c.getField("شماره تماس").setValue(1000000 + getRandomItem_RANDOM.nextInt(8888888) + "");
        c.getField("میزان آشنایی").setValue(getRandomItem(relations));
        return c;
    }

    public ArrayList<Field> getFields() {
        return fields;
    }

    public Field getField(String name) {
        for (Field f : fields)
            if (f.getName().equals(name))
                return f;
        return null;
    }

    public void cloneFrom(ContactModel m) {
        fields = new ArrayList<Field>();
        for (Field f : m.fields)
            fields.add((Field) f.clone());
    }

    @Override
    public Object clone() {
        ContactModel cloned = new ContactModel();
        cloned.cloneFrom(this);
        return cloned;
    }

}
